; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p4---int100n150-m25---int100c110---s66---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level16 level51)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level16 level52)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level16 level53)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level16 level54)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level16 level55)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level16 level56)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level16 level57)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level16 level58)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level16 level59)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level16 level60)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level16 level61)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level16 level62)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level16 level63)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level16 level64)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level16 level65)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level16 level66)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level16 level67)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level16 level68)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level16 level69)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level16 level70)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level16 level71)
(sum level55 level18 level73)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level16 level72)
(sum level56 level18 level74)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level16 level73)
(sum level57 level18 level75)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level16 level74)
(sum level58 level18 level76)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level16 level75)
(sum level59 level18 level77)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level16 level76)
(sum level60 level18 level78)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level16 level77)
(sum level61 level18 level79)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level16 level78)
(sum level62 level18 level80)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level16 level79)
(sum level63 level18 level81)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level16 level80)
(sum level64 level18 level82)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level16 level81)
(sum level65 level18 level83)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level16 level82)
(sum level66 level18 level84)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level16 level83)
(sum level67 level18 level85)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level16 level84)
(sum level68 level18 level86)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level16 level85)
(sum level69 level18 level87)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level16 level86)
(sum level70 level18 level88)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level16 level87)
(sum level71 level18 level89)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level16 level88)
(sum level72 level18 level90)
(sum level72 level20 level92)
(sum level72 level23 level95)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level16 level89)
(sum level73 level18 level91)
(sum level73 level20 level93)
(sum level73 level23 level96)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level16 level90)
(sum level74 level18 level92)
(sum level74 level20 level94)
(sum level74 level23 level97)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level16 level91)
(sum level75 level18 level93)
(sum level75 level20 level95)
(sum level75 level23 level98)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level16 level92)
(sum level76 level18 level94)
(sum level76 level20 level96)
(sum level76 level23 level99)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level77 level16 level93)
(sum level77 level18 level95)
(sum level77 level20 level97)
(sum level77 level23 level100)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level78 level16 level94)
(sum level78 level18 level96)
(sum level78 level20 level98)
(sum level78 level23 level101)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level79 level16 level95)
(sum level79 level18 level97)
(sum level79 level20 level99)
(sum level79 level23 level102)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level80 level16 level96)
(sum level80 level18 level98)
(sum level80 level20 level100)
(sum level80 level23 level103)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level81 level9 level90)
(sum level81 level10 level91)
(sum level81 level16 level97)
(sum level81 level18 level99)
(sum level81 level20 level101)
(sum level81 level23 level104)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level82 level9 level91)
(sum level82 level10 level92)
(sum level82 level16 level98)
(sum level82 level18 level100)
(sum level82 level20 level102)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level83 level9 level92)
(sum level83 level10 level93)
(sum level83 level16 level99)
(sum level83 level18 level101)
(sum level83 level20 level103)
(sum level84 level2 level86)
(sum level84 level3 level87)
(sum level84 level9 level93)
(sum level84 level10 level94)
(sum level84 level16 level100)
(sum level84 level18 level102)
(sum level84 level20 level104)
(sum level85 level2 level87)
(sum level85 level3 level88)
(sum level85 level9 level94)
(sum level85 level10 level95)
(sum level85 level16 level101)
(sum level85 level18 level103)
(sum level86 level2 level88)
(sum level86 level3 level89)
(sum level86 level9 level95)
(sum level86 level10 level96)
(sum level86 level16 level102)
(sum level86 level18 level104)
(sum level87 level2 level89)
(sum level87 level3 level90)
(sum level87 level9 level96)
(sum level87 level10 level97)
(sum level87 level16 level103)
(sum level88 level2 level90)
(sum level88 level3 level91)
(sum level88 level9 level97)
(sum level88 level10 level98)
(sum level88 level16 level104)
(sum level89 level2 level91)
(sum level89 level3 level92)
(sum level89 level9 level98)
(sum level89 level10 level99)
(sum level90 level2 level92)
(sum level90 level3 level93)
(sum level90 level9 level99)
(sum level90 level10 level100)
(sum level91 level2 level93)
(sum level91 level3 level94)
(sum level91 level9 level100)
(sum level91 level10 level101)
(sum level92 level2 level94)
(sum level92 level3 level95)
(sum level92 level9 level101)
(sum level92 level10 level102)
(sum level93 level2 level95)
(sum level93 level3 level96)
(sum level93 level9 level102)
(sum level93 level10 level103)
(sum level94 level2 level96)
(sum level94 level3 level97)
(sum level94 level9 level103)
(sum level94 level10 level104)
(sum level95 level2 level97)
(sum level95 level3 level98)
(sum level95 level9 level104)
(sum level96 level2 level98)
(sum level96 level3 level99)
(sum level97 level2 level99)
(sum level97 level3 level100)
(sum level98 level2 level100)
(sum level98 level3 level101)
(sum level99 level2 level101)
(sum level99 level3 level102)
(sum level100 level2 level102)
(sum level100 level3 level103)
(sum level101 level2 level103)
(sum level101 level3 level104)
(sum level102 level2 level104)

(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l0 l3)
(fuelcost level9 l0 l3)
(connected l1 l3)
(fuelcost level20 l1 l3)
(connected l1 l6)
(fuelcost level16 l1 l6)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l3)
(fuelcost level3 l2 l3)
(connected l2 l4)
(fuelcost level10 l2 l4)
(connected l2 l5)
(fuelcost level9 l2 l5)
(connected l2 l6)
(fuelcost level23 l2 l6)
(connected l3 l0)
(fuelcost level9 l3 l0)
(connected l3 l1)
(fuelcost level20 l3 l1)
(connected l3 l2)
(fuelcost level3 l3 l2)
(connected l3 l6)
(fuelcost level20 l3 l6)
(connected l4 l2)
(fuelcost level10 l4 l2)
(connected l4 l5)
(fuelcost level2 l4 l5)
(connected l5 l2)
(fuelcost level9 l5 l2)
(connected l5 l4)
(fuelcost level2 l5 l4)
(connected l6 l1)
(fuelcost level16 l6 l1)
(connected l6 l2)
(fuelcost level23 l6 l2)
(connected l6 l3)
(fuelcost level20 l6 l3)

(at t0 l3)
(fuel t0 level104)
(= (total-cost) 0)

(at p0 l5)
(at p1 l1)
(at p2 l2)
(at p3 l5)
)

(:goal
(and
(at p0 l0)
(at p1 l2)
(at p2 l1)
(at p3 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l2 level101 level3 level104)
   deleted: (at t0 l3) (fuel t0 level104)
   added: (at t0 l2) (fuel t0 level101)
   goals met: 0 of 4
2. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 4
3. (drive t0 l2 l5 level92 level9 level101)
   deleted: (at t0 l2) (fuel t0 level101)
   added: (at t0 l5) (fuel t0 level92)
   goals met: 0 of 4
4. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 4
5. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 0 of 4
6. (drive t0 l5 l2 level83 level9 level92)
   deleted: (at t0 l5) (fuel t0 level92)
   added: (at t0 l2) (fuel t0 level83)
   goals met: 0 of 4
7. (drive t0 l2 l6 level60 level23 level83)
   deleted: (at t0 l2) (fuel t0 level83)
   added: (at t0 l6) (fuel t0 level60)
   goals met: 0 of 4
8. (unload p3 t0 l6)
   deleted: (in p3 t0)
   added: (at p3 l6)
   goals met: 1 of 4
9. (drive t0 l6 l1 level44 level16 level60)
   deleted: (at t0 l6) (fuel t0 level60)
   added: (at t0 l1) (fuel t0 level44)
   goals met: 1 of 4
10. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 4
11. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 4
12. (drive t0 l1 l3 level24 level20 level44)
   deleted: (at t0 l1) (fuel t0 level44)
   added: (at t0 l3) (fuel t0 level24)
   goals met: 2 of 4
13. (drive t0 l3 l2 level21 level3 level24)
   deleted: (at t0 l3) (fuel t0 level24)
   added: (at t0 l2) (fuel t0 level21)
   goals met: 2 of 4
14. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 4
15. (drive t0 l2 l0 level3 level18 level21)
   deleted: (at t0 l2) (fuel t0 level21)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 3 of 4
16. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 4 of 4
